In [1]:
import pandas as pd

In [2]:
url = 'http://higheredublog.com/top-universities-for-ms-in-mis-in-usa/'

In [3]:
data = pd.read_html(url, header = 0)

In [4]:
data

[    Sr. No                                         University      Program
 0        1                 Carnegie Mellon University (Heinz)         MISM
 1        2          Indiana University – Bloomington (Kelley)        MS IS
 2        3       University of California, Berkeley (iSchool)         MIMS
 3        4  University of Washington, Seattle (iSchool/Fos...  MS IM/MS IS
 4        5                      University of Arizona (Eller)       MS MIS
 5        6       Texas A&M University, College Station (Mays)       MS MIS
 6        7                        New York University (Stern)        MS IS
 7        8                   Rensselaer Polytechnic Institute  MS IT/MS BA
 8        9                      Syracuse University (iSchool)        MS IM
 9       10                     SUNY Buffalo (School of Mgmt.)       MS MIS
 10      11  University of Maryland, College Park (B School...    MS IS/MIM
 11      12          University of Cincinnati, Ohio (B-School)        MS IS
 12      13                    University of Illinois, Chicago       MS MIS
 13      14        University of Michigan, Ann Arbon (iSchool)          MSI
 14      15                    Worcester Polytechnic Institute        MS IT
 15      16                                 Bentley University        MS IT
 16      17         University of Illinois at Urbana–Champaign        MS TM
 17      18                       George Washington University       MS IST
 18      19        Rutgers, The State University of New Jersey        MS IT
 19      20                              Iowa State University        MS IS
 20      21                                  Purdue University       MS CIT
 21      22                          University of Connecticut      MS BAPM
 22      23                   Illinois Institute of Technology       MS ITM
 23      24                           Okhlama State University       MS MIS
 24      25            Polytechnic School of Engineering – NYU       MS MOT
 25      26                             Santa Clara University        MS IS
 26      27                           Georgia State University       MS CIS
 27      28                              University of Florida      MS ISOM
 28      29                    Northeastern University, Boston        MS IS
 29      30                        University of Texas, Dallas       MS ITM
 ..     ...                                                ...          ...
 31      32                        University of South Florida       MS MIS
 32      33                  Rochester Institute of Technology       MS IST
 33      34            University of North Carolina, Charlotte        MS IT
 34      35                            George Mason University        MS IS
 35      36                                 University of Utah        MS IS
 36      37                             University of Arkansas        MS IS
 37      38                      Claremont Graduate University       MS IST
 38      39                             University of Nebraska       MS MIS
 39      40                   University of Texas at Arlington        MS IS
 40      41                              Texas Tech University       MS MIS
 41      42                      University of Texas at Austin        MS BA
 42      43                           Arizona State University        MS BA
 43      44                           University of Pittsburgh        MS IS
 44      45                         University of Pennsylvania       MS CIS
 45      46                 New Jersey Institute of Technology        MS IS
 46      47                         San Diego State University        MS IS
 47      48                                  Boston University       MS CIS
 48      49                  University of Houston, Clear Lake       MS MIS
 49      50                       Northern Illinois University       MS MIS
 50      51           University of Maryland, Baltimore County        MS IS
 51      52                             University of Delaware        MS IS
 52      53                                  Temple University       MS IST
 53      54                              Utah State University       MS MIS
 54      55                          Illinois State University        MS IS
 55      56                     University of Colorado, Denver        MS IS
 56      57               University of Illinois – Springfield       MS MIS
 57      58                                 Cornell University       MPS IS
 58      59                   Florida International University       MS MIS
 59      60                           Brigham Young University         MISM
 60      61                  University of Alabama, Huntsville        MS IS

 [61 rows x 3 columns]]

In [5]:
data1 = data[0]
data1.head()

   Sr. No                                         University      Program
0       1                 Carnegie Mellon University (Heinz)         MISM
1       2          Indiana University – Bloomington (Kelley)        MS IS
2       3       University of California, Berkeley (iSchool)         MIMS
3       4  University of Washington, Seattle (iSchool/Fos...  MS IM/MS IS
4       5                      University of Arizona (Eller)       MS MIS

In [6]:
data1.columns = ['RANKING', 'UNIVERSITY', 'PROGRAM']

In [7]:
data1.dtypes

RANKING        int64
UNIVERSITY    object
PROGRAM       object
dtype: object

In [8]:
data1.head()

   RANKING                                         UNIVERSITY      PROGRAM
0        1                 Carnegie Mellon University (Heinz)         MISM
1        2          Indiana University – Bloomington (Kelley)        MS IS
2        3       University of California, Berkeley (iSchool)         MIMS
3        4  University of Washington, Seattle (iSchool/Fos...  MS IM/MS IS
4        5                      University of Arizona (Eller)       MS MIS

In [9]:
df = pd.DataFrame(data1)
df.head()

   RANKING                                         UNIVERSITY      PROGRAM
0        1                 Carnegie Mellon University (Heinz)         MISM
1        2          Indiana University – Bloomington (Kelley)        MS IS
2        3       University of California, Berkeley (iSchool)         MIMS
3        4  University of Washington, Seattle (iSchool/Fos...  MS IM/MS IS
4        5                      University of Arizona (Eller)       MS MIS

In [10]:
df.to_csv('univ_ranking.csv', index=False, encoding='utf-8')